#define  _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//int main()
//{
//	int a = 10;
//	float f = 10.0;
//	return 0;
//}
//void test(void)//第一个void无返回,第二个void代表无参
//{
//	printf("hehe\n");
//}
//int main()
//{
//	test(100);
//	return 0;
//}
//int main()
//{
//	int a = 20;//4个字节-32bit
//	//00000000000000000000000000010100 - 原、反、补码
//	//0x00000014 - 十六进制
//	int b = -10;//4个字节-32bit
//	//10000000000000000000000000001010 - 原码
//	//11111111111111111111111111110101 - 反码
//	//11111111111111111111111111110110 - 补码
//	//0xFFFFFFF6 - 补码的十六进制
//	return 0;
//}
//int main()
//{
//	int a = 20;
//	//0x00000014
//	//在内存中存储为14000000 - 小端(存储)模式
//	return 0;
//}
////请简述大端字节序和小端字节序的概念，设计一个小程序来判断当前机器的字节序
//int check_system()
//{
//	int a = 1;
//	//返回1,小端；返回0,大端
//    return *(char*)&a;//char*只能访问内存中的第一个字节,*(char*)&a对第一个字节地址进行解引用,值为1
//}
//int main()
//{
//	//返回1,小端；返回0,大端
//	int ret = check_system();
//	if(ret==1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	system("pause");
//	return 0;
//}
//int main()
//{
//	//-1 ==> 11111111111111111111111111111111(在内存的存放-反码)
//	char a = -1;//11111111 - 截断
//	signed char b = -1;//11111111 - 截断
//	unsigned char c = -1;//11111111 - 截断
//	printf("a=%d,b=%d,c=%d",a,b,c);//打印的是原码，存储的是补码
//	//打印整形，char会整形提升
//	//a:11111111->整形提升:11111111111111111111111111111111(补码)
//	//b:11111111->整形提升:11111111111111111111111111111111(补码)
//	//unsigned char c:11111111->整形提升:00000000000000000000000011111111(补码)正数的原、返、补码相同。无符号数整形提升高位补0
//	//-1 -1 255
//	system("pause");
//	return 0;
//} 
//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000 - 原码
//	//11111111111111111111111101111111 - 反码
//	//11111111111111111111111110000000 - 补码
//	//截断:10000000
//	printf("%u\n",a);
//	//%u打印十进制的无符号数字
//	//10000000->char整形提升:11111111111111111111111110000000(补码)无符号数原、反、补码相同。所以值为该数对应的十进制位数字
//	system("pause");
//	return 0;
//}
//int main()
//{
//	char a = 128;//127+1 ==> -128
//	printf("%u\n",a);//与char a = 128值相同
//	system("pause");
//	return 0;
//}
//int main()
//{
//	int i = -20;
//	unsigned int j = 10;
//	printf("%u\n",i+j);
//	system("pause");
//	return 0;
//}
//int main()
//{
//	unsigned int i;//i>0
//	for(i=9;i>=0;i--)//i永远为正,死循环
//	{
//		printf("%u\n",i);
//	}
//	system("pause");
//	return 0;
//}
//int main()
//{
//	char a[1000];
//	int i;
//	for(i=0;i<1000;i++)
//	{
//		a[i] = -1-i;
//	}
//	printf("%d",strlen(a));//strlen计算数组到\0停止,所以值为255
//	return 0;
//}
//unsigned char i = 0;
//int main()
//{
//	for(i=0;i<=255;i++)
//	{
//		printf("hello world\n");
//	}
//	return 0;
//}